Tekla.Structures.Drawing.ReinforcementBase.ReinforcementVisibilityTypes
The available reinforcement visibility types.
Only applies to bar groups and meshes.
See Tekla Structures help, "Setting the visibility of reinforcement in drawings", for more information.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementVisibilityTypes.All
Shows all bars in a group or mesh.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementVisibilityTypes.First
Only shows the first bar in the group or mesh.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementVisibilityTypes.Last
Only shows the last bar in the group or mesh.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementVisibilityTypes.FirstAndLast
Shows the first and last bar in the group or mesh.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementVisibilityTypes.OneInTheMiddle
Shows one bar in the middle of the group or mesh.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementVisibilityTypes.TwoInTheMiddle
Shows two bars in the middle of the group or mesh.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementVisibilityTypes.Customized
Indicates that you have specified the location of the only visible reinforcing bar.
See "Adjusting reinforcing bars" in the Tekla Structures help for more information.